## **Pandas Library - Continuation**

* **Groupby**: is used to split data into groups based on the values of one or more columns. After grouping, you can apply functions such as **mean, sum, count, max, min, etc.**

* Next we will work with: Concatenating, Merging and Joining

In [282]:
import numpy as np
import pandas as pd

In [283]:
datas = {'Groups':['G1','G1','G2','G2','G3','G3'],'Authors':['DanBrawn','GRRMartin','SarahJMass','JayKristoff','ArthurCDoyle','JulioVerne'],'Books':[30,100,35,20,500,75]}

In [284]:
df = pd.DataFrame(datas)
df

  Groups       Authors  Books
0     G1      DanBrawn     30
1     G1     GRRMartin    100
2     G2    SarahJMass     35
3     G2   JayKristoff     20
4     G3  ArthurCDoyle    500
5     G3    JulioVerne     75

In [285]:
# You need to specify the column with numbers, or else it will give an error.
gr = df.groupby('Groups')['Books']

In [286]:
print(gr.mean())

Groups
G1     65.0
G2     27.5
G3    287.5
Name: Books, dtype: float64

In [287]:
gr.sum()

Groups
G1    130
G2     55
G3    575
Name: Books, dtype: int64

In [288]:
# The standard deviation measures how spread out the values are from the mean.
gr.std()

Groups
G1     49.497475
G2     10.606602
G3    300.520382
Name: Books, dtype: float64

In [289]:
gr.sum().loc['G3']

575

In [290]:
df.groupby('Groups').sum().loc['G1']

Authors    DanBrawnGRRMartin
Books                    130
Name: G1, dtype: object

In [291]:
df.groupby('Groups').count()

        Authors  Books
Groups
G1            2      2
G2            2      2
G3            2      2

In [292]:
df.groupby('Groups').describe() # You can use .transpose() for change

       Books
       count   mean         std   min     25%    50%     75%    max
Groups
G1       2.0   65.0   49.497475  30.0   47.50   65.0   82.50  100.0
G2       2.0   27.5   10.606602  20.0   23.75   27.5   31.25   35.0
G3       2.0  287.5  300.520382  75.0  181.25  287.5  393.75  500.0

In [293]:
df.groupby('Groups').describe().transpose()['G3']

Books  count      2.000000
       mean     287.500000
       std      300.520382
       min       75.000000
       25%      181.250000
       50%      287.500000
       75%      393.750000
       max      500.000000
Name: G3, dtype: float64

## **Concatenating** : 

* **Definition:** Concatenation is the process of stacking DataFrames along rows or columns. You can use when you want to simply put DataFrames together without considering keys/columns. One example: Like putting one DataFrame below another (`axis=0`) or side by side (`axis=1`)

* **Function:** `pd.concat([df1, df2], axis=0 or 1)`

## **Merging** :

* **Definition:** Merging is combining DataFrames based on common columns or keys, similar to SQL joins. You can use when you want to bring together data that share a relationship (`"foreign key"`). One example: Like linking a customer table with an orders table by the `customer_id`.

* **Function:** `pd.merge(df1, df2, on="key", how="inner")`

## **Joining**

* **Definition:** A convenient way to merge DataFrames using their index (row labels) instead of columns. You can use when your data is aligned by index. One example: Like attaching extra info to rows that already share the same index.

* **Function:** `df1.join(df2, how="left")`

* **Let's get started!**

In [294]:
import pandas as pd

In [295]:
df_1 = pd.DataFrame({'W':['A1','A2','A3','A4'], 
                     'X':['B1','B2','B3','B4'], 
                     'Y':['C1','C2','C3','C4'], 
                     'Z':['D1','D2','D3','D4']})

In [296]:
df_2 = pd.DataFrame({'W':['E1','E2','E3','E4'], 
                     'X':['F1','F2','F3','F4'], 
                     'Y':['G1','G2','G3','G4'], 
                     'Z':['H1','H2','H3','H4']})

In [297]:
df_3 = pd.DataFrame({'W':['I1','I2','I3','I4'], 
                     'X':['J1','J2','J3','J4'], 
                     'Y':['K1','K2','K3','K4'], 
                     'Z':['L1','L2','L3','L4']})

In [298]:
df_1

    W   X   Y   Z
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4

In [299]:
df_2

    W   X   Y   Z
0  E1  F1  G1  H1
1  E2  F2  G2  H2
2  E3  F3  G3  H3
3  E4  F4  G4  H4

In [300]:
df_3

    W   X   Y   Z
0  I1  J1  K1  L1
1  I2  J2  K2  L2
2  I3  J3  K3  L3
3  I4  J4  K4  L4

# **Concatenation**

In [301]:
pd.concat([df_1,df_2,df_3])

    W   X   Y   Z
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4
0  E1  F1  G1  H1
1  E2  F2  G2  H2
2  E3  F3  G3  H3
3  E4  F4  G4  H4
0  I1  J1  K1  L1
1  I2  J2  K2  L2
2  I3  J3  K3  L3
3  I4  J4  K4  L4

In [302]:
pd.concat([df_1,df_2,df_3],axis=1)

    W   X   Y   Z   W   X   Y   Z   W   X   Y   Z
0  A1  B1  C1  D1  E1  F1  G1  H1  I1  J1  K1  L1
1  A2  B2  C2  D2  E2  F2  G2  H2  I2  J2  K2  L2
2  A3  B3  C3  D3  E3  F3  G3  H3  I3  J3  K3  L3
3  A4  B4  C4  D4  E4  F4  G4  H4  I4  J4  K4  L4

# **Merging**

In [303]:
df_4 = pd.DataFrame({'M':['A1','A2','A3','A4'], 
                     'N':['B1','B2','B3','B4'], 
                     'O':['C1','C2','C3','C4'], 
                     'key':['D1','D2','D3','D4']})
df_4

    M   N   O key
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4

In [304]:
df_5 = pd.DataFrame({'W':['E1','E2','E3','E4'], 
                     'X':['F1','F2','F3','F4'], 
                     'Y':['G1','G2','G3','G4'], 
                     'key':['D1','D2','D3','D4']})
df_5

    W   X   Y key
0  E1  F1  G1  D1
1  E2  F2  G2  D2
2  E3  F3  G3  D3
3  E4  F4  G4  D4

In [305]:
pd.merge(df_4,df_5,how='inner',on='key')

# You can do this with more than one key and it would look like this: 
# pd.merge(df_4,df_5, on = ['key1', 'key2'])
# or: pd.merge(df_4,df_5, how='outer', on = ['key1', 'key2'])
# and: pd.merge(df_4,df_5, how = 'right', on = ['key1', 'key2'])

    M   N   O key   W   X   Y
0  A1  B1  C1  D1  E1  F1  G1
1  A2  B2  C2  D2  E2  F2  G2
2  A3  B3  C3  D3  E3  F3  G3
3  A4  B4  C4  D4  E4  F4  G4

# **Joining**

In [306]:
df_6 = pd.DataFrame({'M':['A1','A2','A3','A4'],
                     'N':['B1','B2','B3','B4'],
                     'O':['C1','C2','C3','C4']},
                       index=['D1','D2','D3','D4'])
df_6

     M   N   O
D1  A1  B1  C1
D2  A2  B2  C2
D3  A3  B3  C3
D4  A4  B4  C4

In [307]:
df_7 = pd.DataFrame({'W':['E1','E2','E3','E4'], 
                     'X':['F1','F2','F3','F4'], 
                     'Y':['G1','G2','G3','G4']}, 
                     index=['D1','D2','D3','D4'])
df_7

     W   X   Y
D1  E1  F1  G1
D2  E2  F2  G2
D3  E3  F3  G3
D4  E4  F4  G4

In [308]:
df_6.join(df_7)

     M   N   O   W   X   Y
D1  A1  B1  C1  E1  F1  G1
D2  A2  B2  C2  E2  F2  G2
D3  A3  B3  C3  E3  F3  G3
D4  A4  B4  C4  E4  F4  G4

In [309]:
df_6.join(df_7, how='outer')

     M   N   O   W   X   Y
D1  A1  B1  C1  E1  F1  G1
D2  A2  B2  C2  E2  F2  G2
D3  A3  B3  C3  E3  F3  G3
D4  A4  B4  C4  E4  F4  G4